CatalogService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 3.0.2 git-revision#91dd558. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is JAX-WS RI 3.0.2 git-revision#91dd558. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://globalbooks.example.com/catalog" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://globalbooks.example.com/catalog" name="CatalogService">
<types>
<xsd:schema>
<xsd:import namespace="http://globalbooks.example.com/catalog" schemaLocation="http://localhost:8888/ws/catalog?xsd=1"></xsd:import>
</xsd:schema>
</types>
<message name="getBookByIsbn">
<part name="parameters" element="tns:getBookByIsbn"></part>
</message>
<message name="getBookByIsbnResponse">
<part name="parameters" element="tns:getBookByIsbnResponse"></part>
</message>
<portType name="CatalogServiceImpl">
<operation name="getBookByIsbn">
<input wsam:Action="http://globalbooks.example.com/catalog/CatalogServiceImpl/getBookByIsbnRequest" message="tns:getBookByIsbn"></input>
<output wsam:Action="http://globalbooks.example.com/catalog/CatalogServiceImpl/getBookByIsbnResponse" message="tns:getBookByIsbnResponse"></output>
</operation>
</portType>
<binding name="CatalogPortBinding" type="tns:CatalogServiceImpl">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
<operation name="getBookByIsbn">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal"></soap:body>
</input>
<output>
<soap:body use="literal"></soap:body>
</output>
</operation>
</binding>
<service name="CatalogService">
<port name="CatalogPort" binding="tns:CatalogPortBinding">
<soap:address location="http://localhost:8888/ws/catalog"></soap:address>
</port>
</service>
</definitions>